Performance_Artillery/05_0_GoIT_Main_Lesson/05_Second_Lesson.yml
config:
  target: "https://httpbin.org"               
  phases:                                     
    - duration: 10                              
      arrivalRate: 2                            # Saniyede 2 yeni sanal kullanıcı gönder (10sn x 2 = 20 kullanıcı)
      name: "Volume Test"
  payload:
    -  path:   "../data/payload-data.csv"       # CSV dosyasının yolu
       fields: ["name", "type"]                 # CSV dosyasındaki kolon isimleri
       skipHeader: true                         # CSV dosyasının başlık satırını atla
       order: sequence                          # İsimlerin sırayla gitmesini istiyorsan ekleyebilirsin
  plugins:                                    
    ensure: {}                                    
  ensure:                                     
    thresholds:                                  
      - http.response_time.p95: 1000              
      - http.response_time.2xx.p99: 1500          
    conditions:                                                                     
      - expression: vusers.failed == 0                                            

scenarios:                                   
  - name: "Create Account with CSV Payload"                  
    flow:                                       
      - get:                                      
          url: "/get?user={{ name }}"             # Değişkeni burada da kullanabilirsin                             
      - post:                                     
          url: "/post"                              
          json:                                     
            name: "{{ name }}"                      # CSV'deki kolon isimlerini "telsiz" gibi bağlıyoruz            
            type: "{{ type }}"                      # CSV'deki kolon isimlerini "telsiz" gibi bağlıyoruz 
          headers:                                
            Content-Type: "application/json"
          capture:
            - json: "$.json"
              as: "responseBody"
      - log: ">> Veri enjekte edildi: {{ name }} as {{ type }}"                    
                 
# REPORT: https://app.artillery.io/share/sh_0502c62242de9d65b209431d2e2b9a8d520bec020a489982b0ce82a650081468

# RUN: artillery run --record --key a9_yzuk07yxm60ipdlsgg2ejtzcx5fwa67w -o second-test-report.json D:\Projects_and_Git-Repos\GoIT_Homeworks\HW-14-19\Performance_Artillery\05_0_GoIT_Main_Lesson\05_Second_Lesson.yml